{
  "courses": [
    {
      "id": 1,
      "name": "Desarrollo web",
      "startDate": "13/Nov/2023",
      "endDate": "13/Nov/2023",
      "description": "En este curso aprenderás a crear tu sitio web partiendo del prototipo en papel. Te sumergirás en las mejores prácticas del desarrollo web, trabajando con HTML y CSS. Conocerás herramientas para optimizar al máximo tu sitio web, implementando prácticas de versionado de código con GIT, y preprocesadores como SASS. Al finalizar, sabrás cómo aplicar Bootstrap a tus proyectos, y comprenderás lo importante del SEO en tus desarrollos. Subirás tu sitio a un servidor, y aprenderás a interactuar con este servicio. También sabrás cómo presentar un presupuesto y atender a tu cliente final."
    },
    {
      "id": 2,
      "name": "Javascript",
      "startDate": "13/Nov/2023",
      "endDate": "13/Nov/2023",
      "description": "En este curso aprenderás los fundamentos del lenguaje de programación más usado en la actualidad, con el cual es posible crear aplicaciones de todo tipo. Explorarás inicialmente herramientas propias del mismo, indagando casos prácticos de aplicación. Reconocerás la utilidad de las librerías estudiando jQuery, y cómo aplicar técnicas de desarrollo para apps modernas con AJAX. Al graduarte, estarás en condiciones de crear soluciones web interactivas, y trasladar los conocimientos del curso a cualquier framework JavaScript."
    },
    {
      "id": 3,
      "name": "Angular",
      "startDate": "13/Nov/2023",
      "endDate": "13/Nov/2023",
      "description": "Aprenderás a crear y mantener aplicaciones web en una sola página con Angular. A través de este framework para aplicaciones web, trabajarás con HTML y TypeScript, pudiendo generar desde el prototipo hasta la implementación completa de una aplicación."
    },
    {
      "id": 4,
      "name": "Ruby",
      "startDate": "13/Nov/2023",
      "endDate": "13/Nov/2023",
      "description": "Un lenguaje de programación dinámico y de código abierto enfocado en la simplicidad y productividad. Su elegante sintaxis se siente natural al leerla y fácil al escribirla."
    },
    {
      "id": 5,
      "name": "Ruby on Rails",
      "startDate": "13/Nov/2023",
      "endDate": "13/Nov/2023",
      "description": "Es un framework de aplicaciones web de código abierto escrito en el lenguaje de programación Ruby, siguiendo el paradigma del patrón Modelo Vista Controlador (MVC). Trata de combinar la simplicidad con la posibilidad de desarrollar aplicaciones del mundo real escribiendo menos código que con otros frameworks y con un mínimo de configuración."
    },
    {
      "id": 6,
      "name": "Python",
      "startDate": "13/Nov/2023",
      "endDate": "13/Nov/2023",
      "description": "En este curso aprenderás las bases de programación uno de los lenguajes más populares en estos tiempos. Partirás desde sus fundamentos, para luego abarcar módulos y sintaxis, hasta el uso de reglas para crear tus primeras aplicaciones. Incorporarás los conocimientos necesarios de Class-Based-View, login - register - accounts, CRUD y modelforms. Desarrollarás una aplicación web estilo blog de la mano de Python en Django Framework."
    }
  ]
}